[DIALOG_102]
BUTTON_1006=Run
BUTTON_1007=Switch
BUTTON_1008=Load Part. Table
BUTTON_1052=Device Part.
BUTTON_1009=Clear
BUTTON_1011=Firmware
BUTTON_1012=Switch
BUTTON_1013=Upgrade
BUTTON_1018=Erase Flash
BUTTON_1020=Demo
BUTTON_1026=...
BUTTON_1027=Download
BUTTON_1028=Flash ID
BUTTON_1029=Flash Info
BUTTON_1030=Read IDB
BUTTON_1031=Restart
BUTTON_1032=Test Device
BUTTON_1033=Export
BUTTON_1034=Erase All
BUTTON_1037=...
BUTTON_1038=Unpack
BUTTON_1044=LBA
BUTTON_1045=Chip Info
BUTTON_1048=...
BUTTON_1049=Execute
BUTTON_1050=MaskROM
BUTTON_1051=Capability
BUTTON_1053=Clear SN
BUTTON_1054=Erase LBA
BUTTON_1055=Export Log
BUTTON_1056=Secure Mode
BUTTON_1057=Switch
BUTTON_1058=Current
BUTTON_1062=Force Write by Addr.
DIALOG_TITLE=RKDevTool
LABEL_1004=
LABEL_1010=Loader:
LABEL_1021=FW Ver.:
LABEL_1022=Loader Ver.:
LABEL_1023=Chip:
LABEL_1024=Firmware:
LABEL_1040=Boot:
LABEL_1041=Firmware:
LABEL_1042=Start:
LABEL_1043=Count:
LABEL_1046=Script:
TABCTRL_1000_Tab_0=Download Image
TABCTRL_1000_Tab_1=Upgrade Firmware
TABCTRL_1000_Tab_2=Advanced

[Prompt]
IDM_ADD=Add Item
IDM_DEL=Delete Item
IDM_CLEAR=Clear All Items
IDM_MOVEUP=Move Up
IDM_MOVEDOWN=Move Down
IDM_LOAD_CONFIG=Import Configuration
IDM_EXPORT_CONFIG=Export Configuration

IDG_ADDRESS=Address
IDG_NAME=Name
IDG_PATH=Path
IDG_STORAGE=Storage

IDS_FOUNDONEDEVICE=Found one %s device
IDS_FOUNDMANYDEVICE=Found multiple devices
IDS_FOUNDNODEVICE=No devices found

ERROR_EXPORT_FAIL=Failed to export configuration!
ERROR_EXPORT_OK=Configuration exported successfully.
ERROR_IMPORT_FAIL=Failed to import configuration!
ERROR_IMPORT_OK=Configuration imported successfully.

ERROR_ACTION_RUNNING=An operation is currently running. Stop it?
ERROR_INITIALIZE=Program initialization failed!
ERROR_NO_DEVICE=No device found. Operation stopped!
ERROR_MANY_DEVICE=Multiple devices found. Operation stopped!
ERROR_GET_DEVICE=Failed to get device. Operation stopped!
ERROR_MATCH_DEVICE_TYPE=Device type mismatch. Operation stopped!
ERROR_CHECK_DOWNLOAD_ITEM=Download item %s does not exist. Operation stopped!
ERROR_NO_DOWNLOAD_ITEM=No download item selected. Operation stopped!
ERROR_PARAMETER_CHANGED=The Parameter file has changed. Verify the updated download addresses before running!
ERROR_NO_PARTSIZE_ITEM=Download item %s has no partition size. Operation stopped!

ERROR_CREATE_IMAGE=Failed to create IMAGE object. Operation stopped!
ERROR_CREATE_COMM=Failed to create COMM object. Operation stopped!
ERROR_CREATE_DEVICE=Failed to create DEVICE object. Operation stopped!
ERROR_CREATE_SCAN=Failed to create SCAN object. Operation stopped!
ERROR_CREATE_STEP=Failed to create STEP object. Operation stopped!
ERROR_CREATE_UPGRADE=Failed to create UPGRADE object. Operation stopped!
ERROR_UPGRADE_SETOBJECT=Failed to set UPGRADE object. Operation stopped!
ERROR_BOOT_BEFORE_LBA=The Boot download must complete before writing LBA data!

INFO_USER_STOP=Operation stopped by user
INFO_WRITE_PARAM_PROGRESS=Downloading Parameter... (%d%%)
INFO_CHECK_PARAM_PROGRESS=Verifying Parameter... (%d%%)
INFO_WRITE_IMAGE_PROGRESS=Downloading %s... (%d%%)
INFO_CHECK_IMAGE_PROGRESS=Verifying %s... (%d%%)
INFO_WRITE_GPT_PROGRESS=Downloading GPT... (%d%%)
INFO_CHECK_GPT_PROGRESS=Verifying GPT... (%d%%)

INFO_DOWNLOAD_IMAGE_START=Starting download of %s...
INFO_DOWNLOAD_IMAGE_OK=Download complete
ERROR_DOWNLOAD_IMAGE=Download failed
ERROR_GET_PARAMETER=Failed to read device parameters
ERROR_PARSE_PARAMETER=Failed to parse Parameter
ERROR_PARSE_GPT=Failed to parse GPT
ERROR_PARSE_RKGPT=Failed to parse RK_GPT
ERROR_NOT_SUPPORT_WRITEGPT=Writing GPT is not supported
ERROR_GET_GPT_FLAG=Failed to read GPT flag
ERROR_READ_FLASHINFO=Failed to read flash information
ERROR_NO_FOUND_PARTITION_OFFSET=Could not find the offset of partition %s
ERROR_PARTSIZE_UNKNOWN=Partition %s size is unknown. Read the partition table from a file or device first.

INFO_UNPACK_UNION_START=Unpacking unified firmware...
INFO_UNPACK_UNION_OK=Unified firmware unpacked successfully
ERROR_UNPACK_UNION_FAIL=Failed to unpack unified firmware
INFO_UNPACK_ANDROID_START=Unpacking Android firmware...
INFO_UNPACK_ANDROID_OK=Android firmware unpacked successfully. Files were saved to the tool's Output directory.
ERROR_UNPACK_ANDROID_FAIL=Failed to unpack Android firmware
INFO_UNPACK_STORAGE_START=Unpacking multi-storage firmware...
INFO_UNPACK_STORAGE_OK=Multi-storage firmware unpacked successfully
ERROR_UNPACK_STORAGE_FAIL=Failed to unpack multi-storage firmware

ERROR_RELOAD_FW=Failed to reload firmware!
ERROR_LOAD_FW=Failed to load firmware!
ERROR_NO_FIRMWARE=Firmware is not loaded!
ERROR_FIRMWARE_DELETE=The firmware file was deleted!
ERROR_UNPACK_TOOL=The unpacking tool was not found!
ERROR_CHECK_FW_PARTITION_SIZE=Partition %s is too small for the image!
ERROR_PARSE_SCRIPT=Failed to parse script!
WARN_FIRMWARE_MODIFIED=The firmware was modified. Reload it and continue upgrading?
INFO_LOAD_DEV_TABLE=Update the download addresses?

ERROR_STORAGE_OP_SUPPORT=Querying the current storage or switching storage is not supported!

ERROR_READ_STORAGE=Failed to read current storage!
INFO_READ_STORAGE=Current storage read successfully.
ERROR_CURRENT_STOR_NOT_SUPPORT=Current storage is %s and is not supported!

ERROR_STORAGE_NO_SEL=Select the storage device to switch to!
ERROR_STORAGE_SEL=The selected storage device is not connected!
INFO_SWITCH_STORAGE=Storage switched successfully.
ERROR_SWITCH_STORAGE=Failed to switch storage!
ERROR_SWITCH_NOT_SUPPORT=Failed to switch storage to %s!


IDS_TESTDEVICEPROGRESSINFO=Testing device... (%d%%)
IDS_LOWERFORMATPROGRESSINFO=Low-level formatting device... (%d%%)
IDS_DOWNLOADIMAGEPROGRESSINFO=Downloading firmware... (%d%%)
IDS_CHECKIMAGEPROGRESSINFO=Verifying firmware... (%d%%)
IDS_TAGBADBLOCKPROGRESSINFO=Marking bad blocks... (%d%%)
IDS_TESTBLOCKPROGRESSINFO=Testing blocks... (%d%%)
IDS_ERASEFLASHPROGRESSINFO=Erasing flash... (%d%%)
IDS_ERASESYSTEMPROGRESSINFO=Erasing system area... (%d%%)
IDS_ERASEUSERDATAPROGRESSINFO=Erasing user data area... (%d%%)
IDS_ERASEPROGRESSINFO=Erasing... (%d%%)

IDS_DOWNLOADBOOT_START=Starting Boot download
IDS_DOWNLOADBOOT_FAIL=Boot download failed
IDS_DOWNLOADBOOT_PASS=Boot download successful
IDS_DOWNLOADIDBLOCK_START=Starting IDB download
IDS_DOWNLOADIDBLOCK_FAIL=IDB download failed
IDS_DOWNLOADIDBLOCK_PASS=IDB download successful
IDS_DOWNLOADIMAGE_START=Starting firmware download
IDS_DOWNLOADIMAGE_FAIL=Firmware download failed
IDS_DOWNLOADIMAGE_PASS=Firmware download successful
IDS_TESTDEVICE_START=Starting device test
IDS_TESTDEVICE_FAIL=Device test failed
IDS_TESTDEVICE_PASS=Device test successful
IDS_LOWERFORMATDEVICE_START=Starting low-level format
IDS_LOWERFORMATDEVICE_FAIL=Low-level format failed
IDS_LOWERFORMATDEVICE_PASS=Low-level format successful
IDS_RESETDEVICE_START=Restarting device...
IDS_RESETDEVICE_FAIL=Failed to restart device
IDS_RESETDEVICE_PASS=Device restarted successfully
IDS_SETRESETFLAG_START=Restarting device into MSC mode...
IDS_SETRESETFLAG_FAIL=Failed to restart device into MSC mode
IDS_SETRESETFLAG_PASS=Device restarted into MSC mode successfully
IDS_FORMATDISK_START=Formatting disk...
IDS_FORMATDISK_FAIL=Disk format failed
IDS_FORMATDISK_PASS=Disk formatted successfully
IDS_COPYDATA_START=Copying data...
IDS_COPYDATA_FAIL=Data copy failed
IDS_COPYDATA_PASS=Data copied successfully
IDS_WAITMSC_START=Waiting for MSC mode...
IDS_WAITMSC_FAIL=Waiting for MSC mode failed
IDS_WAITMSC_PASS=MSC mode detected
IDS_WAITLOADER_START=Waiting for Loader mode...
IDS_WAITLOADER_FAIL=Waiting for Loader mode failed
IDS_WAITLOADER_PASS=Loader mode detected
IDS_WAITMASKROM_START=Waiting for MaskROM mode...
IDS_WAITMASKROM_FAIL=Waiting for MaskROM mode failed
IDS_WAITMASKROM_PASS=MaskROM mode detected
IDS_ERASEIDB_START=Erasing IDB...
IDS_ERASEIDB_FAIL=Failed to erase IDB
IDS_ERASEIDB_PASS=IDB erased successfully
IDS_SWITCHROCKUSB_START=Switching to RockUSB mode...
IDS_SWITCHROCKUSB_FAIL=Failed to switch to RockUSB mode
IDS_SWITCHROCKUSB_PASS=Switched to RockUSB mode successfully
IDS_RESETMSC_START=Restarting MSC...
IDS_RESETMSC_FAIL=Failed to restart MSC
IDS_RESETMSC_PASS=MSC restarted successfully
IDS_SHOWUSERDISK_START=Showing user disk...
IDS_SHOWUSERDISK_FAIL=Failed to show user disk
IDS_SHOWUSERDISK_PASS=User disk shown successfully
IDS_CHECKCHIP_START=Checking chip...
IDS_CHECKCHIP_FAIL=Chip check failed
IDS_CHECKCHIP_PASS=Chip check successful
IDS_GETFLASHINFO_START=Reading flash information...
IDS_GETFLASHINFO_FAIL=Failed to read flash information
IDS_GETFLASHINFO_PASS=Flash information read successfully
IDS_GETCAPABILITY_START=Reading device capability...
IDS_GETCAPABILITY_FAIL=Failed to read device capability
IDS_GETCAPABILITY_PASS=Device capability read successfully
IDS_GETCHIPINFO_START=Reading chip information...
IDS_GETCHIPINFO_FAIL=Failed to read chip information
IDS_GETCHIPINFO_PASS=Chip information read successfully
IDS_PREPAREIDB_START=Preparing IDB...
IDS_PREPAREIDB_FAIL=Failed to prepare IDB
IDS_PREPAREIDB_PASS=IDB prepared successfully
IDS_MUTEXRESETDEVICE_START=Restarting device (exclusive operation)...
IDS_MUTEXRESETDEVICE_FAIL=Exclusive device restart failed
IDS_MUTEXRESETDEVICE_PASS=Exclusive device restart successful
IDS_ERASEALLBLOCKS_START=Erasing flash...
IDS_ERASEALLBLOCKS_FAIL=Failed to erase flash
IDS_ERASEALLBLOCKS_PASS=Flash erased successfully
IDS_GETBLOCKSTATE_START=Reading block status...
IDS_GETBLOCKSTATE_FAIL=Failed to read block status
IDS_GETBLOCKSTATE_PASS=Block status read successfully
IDS_FINDUSERDISK_START=Searching for user disk...
IDS_FINDUSERDISK_FAIL=Failed to find user disk
IDS_FINDUSERDISK_PASS=User disk found
IDS_READFLASHID_START=Reading flash ID...
IDS_READFLASHID_FAIL=Failed to read flash ID
IDS_READFLASHID_PASS=Flash ID read successfully
IDS_READIDB_START=Reading IDB...
IDS_READIDB_FAIL=Failed to read IDB
IDS_EXPORTIDB_START=Exporting IDB...
IDS_EXPORTIDB_FAIL=Failed to export IDB
IDS_EXPORTIDB_PASS=IDB exported successfully to the program's Output directory
IDS_EXPORTIMAGE_START=Exporting image...
IDS_EXPORTIMAGE_FAIL=Failed to export image
IDS_EXPORTIMAGE_PASS=Image exported successfully to the program's Output directory
IDS_READPARTTABLE_FAIL=Failed to read partition table
IDS_READPARTTABLE_PASS=Partition table read successfully
IDS_CLEARSN_START=Clearing serial number...
IDS_CLEARSN_FAIL=Failed to clear serial number
IDS_CLEARSN_PASS=Serial number cleared successfully
IDS_LOADPARTTABLE_FAIL=Failed to load partition table
IDS_LOADPARTTABLE_PASS=Partition table loaded successfully
IDS_ERASELBA_START=Erasing sectors: start=0x%x, count=0x%x
IDS_ERASELBA_FAIL=Failed to erase sectors
IDS_ERASELBA_PASS=Sectors erased successfully
IDS_ERASEBLOCK_START=Erasing blocks: start=0x%x, count=0x%x
IDS_ERASEBLOCK_FAIL=Failed to erase blocks
IDS_ERASEBLOCK_PASS=Blocks erased successfully
IDS_EXPORTCOMLOG_START=Exporting serial log...
IDS_EXPORTCOMLOG_FAIL=Failed to export serial log
IDS_EXPORTCOMLOG_PASS=Serial log exported successfully to the Output directory
IDS_READSECURE_START=Detecting secure mode...
IDS_READSECURE_FAIL=Failed to read secure-mode flag
IDS_SECUREMODE=Currently in Secure Mode
IDS_NORMALMODE=Currently in non-secure mode
IDS_SWITCHSTORAGE=Switching storage to %s...
IDS_SWITCHSTORAGE_FAIL=Failed to switch storage
IDS_DOWNLOADSTORAGE=Downloading %s firmware...
IDS_GETSTORAGEFAIL=Failed to get the device's current storage
IDS_STORAGENOTSUPPORT=Device does not support %s
IDS_SWITCHSTORAGEFAIL=Failed to switch to %s storage
IDS_SWITCHSTORAGEFAIL_LOADER=Failed to switch to %s storage. Loader does not support storage switching.
IDS_SWITCHRESETFAIL=Failed to restart and switch to %s
IDS_IDB_DESTROY=IDB will be overwritten by %s. Do not write data before sector %d.
IDS_GETFLASHSIZE_FAIL=Reported flash size is zero
IDS_GETFLASHCS_FAIL=No flash chip-select (CS) found
IDS_CROSS_FLASH=%s exceeds the flash size
IDS_NOT_MATCH_STOR_FW=No update data for %s was found in the firmware

ERR_IMAGE_OPEN=Note: Check that the firmware file exists and is not in use.
ERR_IMAGE_TAG=Note: Invalid firmware identifier. Check the firmware packaging process.
ERR_IMAGE_HASH=Note: Firmware digest check failed. Confirm that the firmware has not been modified.
ERR_IMAGE_BOOT_TAG=Note: Invalid Loader identifier in the firmware. Check the Loader.
ERR_IMAGE_BOOT_HASH=Note: Loader digest check failed in the firmware. Check the Loader.

ERR_COMM_RW=Note: Communication error. If intermittent, check the USB connection; if persistent, check the device side.
ERR_WRONG_CHIP=Note: The chip identifier in the firmware is incorrect. Read the chip information with the tool, then regenerate the firmware.
ERR_DEVICE_CREATE=Note: The device is not responding or has disconnected. Restart the device and try again.
ERR_RUN_BOOT471=Note: Check the DDR or main SoC/controller. Restart the device before trying again.
ERR_RUN_BOOT472=Note: Check USB. Restart the device before trying again.
ERR_NO_FLASH_CS=Note: Check that the flash chip is supported and properly soldered.
ERR_FW_READ=Note: Update the firmware packaging tool and regenerate the firmware.
ERR_CROSS_IDBLOCK=Note: The partition image's write address is too low and will overwrite the IDB.
ERR_PARTITION_NOT_ENOUGH=Note: A partition defined in the firmware is too small for its image.
ERR_CROSS_FLASH=Note: A partition defined in the firmware exceeds the flash size.
ERR_UBI_PAGE_CHECK=Note: The UBI image page size does not match the actual flash chip page size. See the tool log for details.
